<?php
namespace Armd\RegionBundle\DataFixtures\ORM;

use Doctrine\Common\DataFixtures\AbstractFixture;
use Doctrine\Common\DataFixtures\OrderedFixtureInterface;
use Doctrine\Common\Persistence\ObjectManager;
use Armd\RegionBundle\Entity\News;

class LoadRegionData extends AbstractFixture implements OrderedFixtureInterface
{
    private $list = array(
        array('Омская область', 52, 57),
        array('Белгородская область', 14, 34),
        array('Томская область', 69, 71),
        array('Брянская область', 15, 35),
        array('Владимирская область', 17, 36),
        array('Курганская область', 37, 47),
        array('Воронежская область', 20, 39),
        array('Ивановская область', 24, 40),
        array('Свердловская область', 65, 67),
        array('Калужская область', 29, 43),
        array('Костромская область', 34, 46),
        array('Тюменская область', 71, 73),
        array('Курская область', 38, 48),
        array('Липецкая область', 42, 50),
        array('Челябинская область', 75, 75),
        array('Московская область', 46, 52),
        array('Орловская область', 54, 59),
        array('Ханты-Мансийский автономный округ — Югра', 71, 81),
        array('Рязанская область', 61, 63),
        array('Смоленская область', 66, 68),
        array('Ямало-Ненецкий автономный округ', 71, 83),
        array('Тамбовская область', 68, 69),
        array('Тверская область', 28, 70),
        array('Республика Башкортостан', 80, 3),
        array('Тульская область', 70, 72),
        array('Ярославская область', 78, 76),
        array('Республика Марий Эл', 88, 12),
        array('Москва', 45, 77),
        array('Республика Мордовия', 89, 13),
        array('Республика Адыгея', 79, 1),
        array('Республика Калмыкия', 85, 8),
        array('Краснодарский край', 03, 25),
        array('Астраханская область', 12, 33),
        array('Волгоградская область', 18, 37),
        array('Ростовская область', 60, 62),
        array('Республика Карелия', 86, 10),
        array('Республика Коми', 87, 11),
        array('Архангельская область', 11, 32),
        array('Вологодская область', 19, 38),
        array('Калининградская область', 27, 42),
        array('Ленинградская область', 41, 49),
        array('Мурманская область', 47, 53),
        array('Новгородская область', 49, 55),
        array('Псковская область', 58, 61),
        array('Санкт-Петербург', 40, 78),
        array('Ненецкий автономный округ', 11, 80),
        array('Республика Саха (Якутия)', 98, 14),
        array('Камчатский край', 30, 24),
        array('Приморский край', 05, 28),
        array('Хабаровский край', 08, 30),
        array('Амурская область', 10, 31),
        array('Магаданская область', 44, 51),
        array('Сахалинская область', 64, 66),
        array('Еврейская автономная область', 99, 79),
        array('Чукотский автономный округ', 77, 82),
        array('Республика Алтай', 84, 2),
        array('Республика Бурятия', 81, 4),
        array('Республика Тыва', 93, 17),
        array('Республика Хакасия', 95, 19),
        array('Алтайский край', 01, 22),
        array('Забайкальский край', 76, 23),
        array('Красноярский край', 04, 26),
        array('Иркутская область', 25, 41),
        array('Кемеровская область', 32, 44),
        array('Новосибирская область', 50, 56),
        array('Республика Татарстан', 92, 16),
        array('Чувашская Республика', 97, 21),
        array('Кировская область', 33, 45),
        array('Нижегородская область', 22, 54),
        array('Оренбургская область', 53, 58),
        array('Пензенская область', 56, 60),
        array('Удмуртская Республика', 94, 18),
        array('Пермский край', 57, 27),
        array('Самарская область', 36, 64),
        array('Саратовская область', 63, 65),
        array('Ульяновская область', 73, 74),
        array('Республика Дагестан', 82, 5),
        array('Республика Ингушетия', 26, 6),
        array('Кабардино-Балкарская Республика', 83, 7),
        array('Карачаево-Черкесская Республика', 91, 9),
        array('Республика Северная Осетия — Алания', 90, 15),
        array('Чеченская Республика', 96, 20),
        array('Ставропольский край', 07, 29),
    );

    public function load(ObjectManager $manager)
    {
        foreach($this->list as $r) 
        {
            $item = new Region();
            $item->setTitle($r[0]);
            $item->setCode($r[1]);
            $item->setOkato($r[2]);
                
            $manager->persist($news);
        }
        
        $manager->flush();
    }

    public function getOrder()
    {
        return 103;
    }

}
